# IFCHybrid Import Update Elements Method

Source: https://www.revitapidocs.com/2026/3eaadf29-6582-554a-168d-77e9bc09624c.htm

---

| IFCHybrid Import Update Elements Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | UpdateElements(Document, String) | **Obsolete.** Updates IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String, IFCHybridImportOptions) | Updates IFC Elements using AnyCAD. |

Top See Also

#### Reference

IFCHybridImport Class Autodesk.Revit.DB.IFC Namespace